<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"e1078c089b8340ef7679418b607ad018fae9f9ab8de5be4eadf776eb1acbb2fd","plan_job_ref":"Job Create Terraform plan (DEV) #144 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15088808389","plan_out_hash":"40c4effb335748d308b99ba296eb6356b2a1c08c9f1fc2fdfe9c7a7f4749da8a","plan_hash":"747c798eb0bfe70500f7362873cd7fcf51e84d4600f3525895de33c607f43229","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 15 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.ESOFederatedIdentity will be created
+   resource "azurerm_federated_identity_credential" "ESOFederatedIdentity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = (known after apply)
+       name                = "ESOFederatedIdentity"
+       parent_id           = (known after apply)
+       resource_group_name = (known after apply)
+       subject             = "system:serviceaccount:default:workload-identity-sa"
    }

  # azurerm_key_vault.vault will be created
+   resource "azurerm_key_vault" "vault" {
+       access_policy                 = (known after apply)
+       enable_rbac_authorization     = true
+       enabled_for_disk_encryption   = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       name                          = "openmrs-dev-vault"
+       public_network_access_enabled = true
+       purge_protection_enabled      = false
+       resource_group_name           = "rg-openmrscore-dev"
+       sku_name                      = "standard"
+       soft_delete_retention_days    = 7
+       tenant_id                     = "************************************"
+       vault_uri                     = (known after apply)

+       contact (known after apply)

+       network_acls (known after apply)
    }

  # azurerm_kubernetes_cluster.aks will be created
+   resource "azurerm_kubernetes_cluster" "aks" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "openmrs-dev-audioprothese-dns-aks"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "francecentral"
+       name                                = "openmrs-dev-audioprothese-aks"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_enabled                 = true
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "rg-openmrscore-dev"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment"  = "dev"
+           "organization" = "audioprothese"
+           "project"      = "openmrs"
        }
+       workload_identity_enabled           = true

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 2
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       web_app_routing {
+           dns_zone_ids             = [
+               "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh",
            ]
+           web_app_routing_identity = (known after apply)
        }

+       windows_profile (known after apply)
    }

  # azurerm_role_assignment.acr_pull will be created
+   resource "azurerm_role_assignment" "acr_pull" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerRegistry/registries/openmrsdevacr"
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aks_dns will be created
+   resource "azurerm_role_assignment" "aks_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh"
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.external_dns will be created
+   resource "azurerm_role_assignment" "external_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh"
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.keyvault_secrets_user will be created
+   resource "azurerm_role_assignment" "keyvault_secrets_user" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # helm_release.alloy will be created
+   resource "helm_release" "alloy" {
+       atomic                     = false
+       chart                      = "alloy"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "alloy"
+       namespace                  = "alloy"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                alloy:
                  configMap:
                    content: |
                      loki.write "default" {
                        endpoint {
                          url = "http://loki-gateway.loki.svc.cluster.local/loki/api/v1/push"
                        }
                      }
                      // local.file_match discovers files on the local filesystem using glob patterns and the doublestar library. It returns an array of file paths.
                      local.file_match "node_logs" {
                        path_targets = [{
                            // Monitor syslog to scrape node-logs
                            __path__  = "/var/log/syslog",
                            job       = "node/syslog",
                            node_name = sys.env("HOSTNAME"),
                            cluster   = "dev",
                        }]
                      }
                
                      // loki.source.file reads log entries from files and forwards them to other loki.* components.
                      // You can specify multiple loki.source.file components by giving them different labels.
                      loki.source.file "node_logs" {
                        targets    = local.file_match.node_logs.targets
                        forward_to = [loki.write.default.receiver]
                      }
                
                      // discovery.kubernetes allows you to find scrape targets from Kubernetes resources.
                      // It watches cluster state and ensures targets are continually synced with what is currently running in your cluster.
                      discovery.kubernetes "pod" {
                        role = "pod"
                      }
                
                      // discovery.relabel rewrites the label set of the input targets by applying one or more relabeling rules.
                      // If no rules are defined, then the input targets are exported as-is.
                      discovery.relabel "pod_logs" {
                        targets = discovery.kubernetes.pod.targets
                
                        // Label creation - "namespace" field from "__meta_kubernetes_namespace"
                        rule {
                          source_labels = ["__meta_kubernetes_namespace"]
                          action = "replace"
                          target_label = "namespace"
                        }
                
                        // Label creation - "pod" field from "__meta_kubernetes_pod_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_name"]
                          action = "replace"
                          target_label = "pod"
                        }
                
                        // Label creation - "container" field from "__meta_kubernetes_pod_container_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "container"
                        }
                
                        // Label creation -  "app" field from "__meta_kubernetes_pod_label_app_kubernetes_io_name"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_label_app_kubernetes_io_name"]
                          action = "replace"
                          target_label = "app"
                        }
                
                        // Label creation -  "job" field from "__meta_kubernetes_namespace" and "__meta_kubernetes_pod_container_name"
                        // Concatenate values __meta_kubernetes_namespace/__meta_kubernetes_pod_container_name
                        rule {
                          source_labels = ["__meta_kubernetes_namespace", "__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "job"
                          separator = "/"
                          replacement = "$1"
                        }
                
                        // Label creation - "container" field from "__meta_kubernetes_pod_uid" and "__meta_kubernetes_pod_container_name"
                        // Concatenate values __meta_kubernetes_pod_uid/__meta_kubernetes_pod_container_name.log
                        rule {
                          source_labels = ["__meta_kubernetes_pod_uid", "__meta_kubernetes_pod_container_name"]
                          action = "replace"
                          target_label = "__path__"
                          separator = "/"
                          replacement = "/var/log/pods/*$1/*.log"
                        }
                
                        // Label creation -  "container_runtime" field from "__meta_kubernetes_pod_container_id"
                        rule {
                          source_labels = ["__meta_kubernetes_pod_container_id"]
                          action = "replace"
                          target_label = "container_runtime"
                          regex = "^(\\S+):\\/\\/.+$"
                          replacement = "$1"
                        }
                      }
                
                      // loki.source.kubernetes tails logs from Kubernetes containers using the Kubernetes API.
                      loki.source.kubernetes "pod_logs" {
                        targets    = discovery.relabel.pod_logs.output
                        forward_to = [loki.process.pod_logs.receiver]
                      }
                
                      // loki.process receives log entries from other Loki components, applies one or more processing stages,
                      // and forwards the results to the list of receivers in the component's arguments.
                      loki.process "pod_logs" {
                        stage.static_labels {
                            values = {
                              cluster = "dev",
                            }
                        }
                
                        forward_to = [loki.write.default.receiver]
                      }
                
                      // loki.source.kubernetes_events tails events from the Kubernetes API and converts them
                      // into log lines to forward to other Loki components.
                      loki.source.kubernetes_events "cluster_events" {
                        job_name   = "integrations/kubernetes/eventhandler"
                        log_format = "logfmt"
                        forward_to = [
                          loki.process.cluster_events.receiver,
                        ]
                      }
                
                      // loki.process receives log entries from other loki components, applies one or more processing stages,
                      // and forwards the results to the list of receivers in the component's arguments.
                      loki.process "cluster_events" {
                        forward_to = [loki.write.default.receiver]
                
                        stage.static_labels {
                          values = {
                            cluster = "dev",
                          }
                        }
                
                        stage.labels {
                          values = {
                            kubernetes_cluster_events = "job",
                          }
                        }
                      }
                
                ingress:
                  enabled: true
                  ingressClassName: "webapprouting.kubernetes.azure.com"
                  labels: {}
                  path: /
                  pathType: Prefix
                  hosts:
                    - alloy.dev.audioprothese.ovh
                  faroPort: 12345
                  extraPaths: []
            EOT,
        ]
+       verify                     = false
+       version                    = "1.0.3"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                global:
                  domain: argocd.dev.audioprothese.ovh
                
                certificate:
                  enabled: true
                
                server:
                  autoscaling:
                    enabled: false
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      appgw.ingress.kubernetes.io/backend-protocol: "https"
                    tls: true
                
                redis-ha:
                  enabled: false
                
                controller:
                  replicas: 1
                
                repoServer:
                  autoscaling:
                    enabled: false
                
                applicationSet:
                  replicas: 1
                
                configs:
                  params:
                    server.insecure: true
            EOT,
        ]
+       verify                     = false
+       version                    = "8.0.3"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.cert_manager will be created
+   resource "helm_release" "cert_manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "cert-manager"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                crds:
                  enabled: true
            EOT,
        ]
+       verify                     = false
+       version                    = "v1.17.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                loki:
                  commonConfig:
                    replication_factor: 1
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: s3
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  pattern_ingester:
                    enabled: true
                  limits_config:
                    allow_structured_metadata: true
                    volume_enabled: true
                  ruler:
                    enable_api: true
                  auth_enabled: false
                
                minio:
                  enabled: true
                
                deploymentMode: SingleBinary
                
                singleBinary:
                  replicas: 1
                
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                ingester:
                  replicas: 0
                querier:
                  replicas: 0
                queryFrontend:
                  replicas: 0
                queryScheduler:
                  replicas: 0
                distributor:
                  replicas: 0
                compactor:
                  replicas: 0
                indexGateway:
                  replicas: 0
                bloomCompactor:
                  replicas: 0
                bloomGateway:
                  replicas: 0
                
                resultsCache:
                  enabled: false
                
                chunksCache:
                  enabled: false
            EOT,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.openmrs will be created
+   resource "helm_release" "openmrs" {
+       atomic                     = false
+       chart                      = "openmrs"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "openmrs"
+       namespace                  = "openmrs"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "oci://registry-1.docker.io/openmrs"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ---
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-backend"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-frontend"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-gateway"
                
                  service:
                    type: ClusterIP
                    port: 80
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.5"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.prometheus-stack will be created
+   resource "helm_release" "prometheus-stack" {
+       atomic                     = false
+       chart                      = "kube-prometheus-stack"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "prometheus-stack"
+       namespace                  = "monitoring"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://prometheus-community.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ---
                prometheus:
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    hosts:
                      - prometheus.dev.audioprothese.ovh
                    path: /
                    pathType: Prefix
                
                grafana:
                  adminUser: admin
                  adminPassword: password
                  ingress:
                    enabled: true
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - grafana.dev.audioprothese.ovh
                    extraPaths: []
                    tls:
                      - hosts:
                          - grafana.dev.audioprothese.ovh
                        secretName: grafana-tls
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                  datasources:
                    datasources.yaml:
                      apiVersion: 1
                      datasources:
                        - name: Loki
                          type: loki
                          url: http://loki-gateway.loki.svc.cluster.local/
                
                  envFromSecret: grafana-azuread-secret
                
                  grafana.ini:
                    server:
                      root_url: "https://grafana.dev.audioprothese.ovh/"
                      domain: "grafana.dev.audioprothese.ovh"
                
                    auth:
                      disable_login_form: true
                    
                    users:
                      auto_assign_org: true
                      auto_assign_org_role: Admin
                
                    auth.generic_oauth:
                      enabled: true
                      name: AzureAD
                      client_id: $__env{GF_AUTH_GENERIC_OAUTH_CLIENT_ID}
                      client_secret: $__env{GF_AUTH_GENERIC_OAUTH_CLIENT_SECRET}
                      scopes: "openid profile email offline_access"
                      allow_assign_grafana_admin: "true"
                      auto_login: "true"
                      auth_url:  "https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/oauth2/v2.0/authorize"
                      token_url: "https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/oauth2/v2.0/token"
                      api_url: "https://graph.microsoft.com/v1.0/me"
                      email_attribute_path: preferred_username
                      allow_sign_up: true
                      log_auth_info: true
                      role_attribute_path: "Admin"
            EOT,
        ]
+       verify                     = false
+       version                    = "72.3.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubectl_manifest.cluster_issuer will be created
+   resource "kubectl_manifest" "cluster_issuer" {
+       api_version             = (known after apply)
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = (known after apply)
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = (known after apply)
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = (known after apply)
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.openmrs_ingress will be created
+   resource "kubectl_manifest" "openmrs_ingress" {
+       api_version             = "networking.k8s.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Ingress"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "openmrs-gateway-ingress"
+       namespace               = "openmrs"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: letsencrypt-prod
                nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
              name: openmrs-gateway-ingress
              namespace: openmrs
            spec:
              ingressClassName: webapprouting.kubernetes.azure.com
              rules:
              - host: openmrs.dev.audioprothese.ovh
                http:
                  paths:
                  - backend:
                      service:
                        name: gateway
                        port:
                          number: 80
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - openmrs.dev.audioprothese.ovh
                secretName: openmrs-tls
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   name_servers = [
+       "ns1-02.azure-dns.com.",
+       "ns2-02.azure-dns.net.",
+       "ns3-02.azure-dns.org.",
+       "ns4-02.azure-dns.info.",
    ]
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #144](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15088808389)